src/InformationRegisters/РаспределениеЗапасов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>РаспределениеЗапасов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Свободно</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РаспределениеЗапасовСостояния</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ХозяйственныеОперации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ХозяйственныеОперации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвратОтКомиссионера</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвратТоваровОтКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПередачаНаКомиссию</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/РаспределениеЗапасовСостояния.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>РаспределениеЗапасовСостояния</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОстатокНаСкладе</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/ИС_Сбер_Отправление.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ИС_Сбер_Отправление</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>orderCode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>confirmedTimeLimit</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>packingTimeLimit</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>shippingTimeLimit</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>shipmentDateFrom</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>shipmentDateTo</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>deliveryId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>shipmentDateShift</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>shipmentIsChangeable</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>customerFullName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>customerAddress</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>shippingPoint</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>deliveryDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>deliveryDateFrom</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>deliveryDateTo</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>status</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИС_Сбер_СтатусыОтправлений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>deliveryMethodId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>serviceScheme</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>customer</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>depositedAmount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>items</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>itemIndex</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>status</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИС_Сбер_СтатусыОтправлений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>subStatus</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИС_Сбер_ДетализацияСтатусовОтмены</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>price</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>finalPrice</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>quantity</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>offerId</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>goodsId</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>digitalMark</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>boxIndex</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураМегаМаркета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИС_Сбер_Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Catalogs/ВариантыКомплектацииНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ВариантыКомплектацииНоменклатуры</Name>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НоменклатураОсновногоКомпонента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХарактеристикаОсновногоКомпонента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВариантРасчетаЦеныНабора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыРасчетаЦенНаборов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДоляСтоимости</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ХарактеристикиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ХарактеристикиНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХарактеристикаНоменклатурыДляЦенообразования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатурыДляЦенообразования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/ИС_Сбер_СерверЛокализация/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

//+ ИнфоСофт Ивонин К.А. 28.11.23 УА #55166
Функция ПолучитьЗапросСпискаОтправлений() Экспорт
	
	Текст =
	"ВЫБРАТЬ
	|	ИС_Сбер_Отправление.Ссылка КАК Ссылка,
	//+ ИнфоСофт Конышев А.Е. 11.12.24 УА #77940
	|	ИС_Сбер_Отправление.Заказ КАК Заказ1C,
	//- ИнфоСофт Конышев А.Е. 11.12.24 УА #77940
	|	ПередачаТоваровХранителю.Ссылка КАК Реализация
	|ПОМЕСТИТЬ ВТ_Реализации
	|ИЗ
	|	Документ.ИС_Сбер_Отправление КАК ИС_Сбер_Отправление
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровХранителю КАК ПередачаТоваровХранителю
	|		ПО ИС_Сбер_Отправление.Заказ = ПередачаТоваровХранителю.ЗаказКлиента
	|			И (НЕ ИС_Сбер_Отправление.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка))
	|ГДЕ
	|	ИС_Сбер_Отправление.Профиль = &Профиль
	|	И НЕ ИС_Сбер_Отправление.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|	И НЕ ПередачаТоваровХранителю.Ссылка ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ИС_Сбер_Отправление.Ссылка,
	//+ ИнфоСофт Конышев А.Е. 11.12.24 УА #77940
	|	ИС_Сбер_Отправление.Заказ КАК Заказ1C,
	//- ИнфоСофт Конышев А.Е. 11.12.24 УА #77940
	|	ПередачаТоваровХранителюТовары.Ссылка
	|ИЗ
	|	Документ.ИС_Сбер_Отправление КАК ИС_Сбер_Отправление
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровХранителю.Товары КАК ПередачаТоваровХранителюТовары
	|		ПО ИС_Сбер_Отправление.Заказ = ПередачаТоваровХранителюТовары.ЗаказКлиента
	|			И (НЕ ИС_Сбер_Отправление.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка))
	|ГДЕ
	|	ИС_Сбер_Отправление.Профиль = &Профиль
	|	И НЕ ИС_Сбер_Отправление.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|	И НЕ ПередачаТоваровХранителюТовары.Ссылка ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ
    |
	|ВЫБРАТЬ
	|	ИС_Сбер_Отправление.Ссылка,
	//+ ИнфоСофт Конышев А.Е. 11.12.24 УА #77940
	|	ИС_Сбер_Отправление.Заказ КАК Заказ1C,
	//- ИнфоСофт Конышев А.Е. 11.12.24 УА #77940
	|	РеализацияТоваровУслуг.Ссылка
	|ИЗ
	|	Документ.ИС_Сбер_Отправление КАК ИС_Сбер_Отправление
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО ИС_Сбер_Отправление.Заказ = РеализацияТоваровУслуг.ЗаказКлиента
	|		И (НЕ ИС_Сбер_Отправление.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка))
	|ГДЕ
	|	ИС_Сбер_Отправление.Профиль = &Профиль
	|	И НЕ ИС_Сбер_Отправление.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|	И НЕ РеализацияТоваровУслуг.Ссылка ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ                                 
	|	ИС_Сбер_Отправление.Ссылка,
	//+ ИнфоСофт Конышев А.Е. 11.12.24 УА #77940
	|	ИС_Сбер_Отправление.Заказ КАК Заказ1C,
	//- ИнфоСофт Конышев А.Е. 11.12.24 УА #77940
	|	РеализацияТоваровУслугТовары.Ссылка
	|ИЗ
	|	Документ.ИС_Сбер_Отправление КАК ИС_Сбер_Отправление
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|		ПО ИС_Сбер_Отправление.Заказ = РеализацияТоваровУслугТовары.ЗаказКлиента
	|		И (НЕ ИС_Сбер_Отправление.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка))
	|ГДЕ
	|	ИС_Сбер_Отправление.Профиль = &Профиль
	|	И НЕ ИС_Сбер_Отправление.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|	И НЕ РеализацияТоваровУслугТовары.Ссылка ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Реализации.Ссылка КАК Ссылка,
	|	МАКСИМУМ(ВТ_Реализации.Реализация) КАК Реализация,
	|	СУММА(1) КАК Количество
	|ПОМЕСТИТЬ ВТ_КоличествоРеализаций
	|ИЗ
	|	ВТ_Реализации КАК ВТ_Реализации
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Реализации.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	//+ ИнфоСофт Конышев А.Е. 09.12.24 УА #77940
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка КАК Ссылка,
	|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение КАК Распоряжение
	|ПОМЕСТИТЬ ВТ_РасходныеОрдера
	|ИЗ
	|	Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыТоварыПоРаспоряжениям
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Реализации КАК ВТ_Реализации
	|		ПО РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение = ВТ_Реализации.Заказ1C
	|;
	|////////////////////////////////////////////////////////////////////////////////
	//- ИнфоСофт Конышев А.Е. 09.12.24 УА #7794
	//+ ИнфоСофт Стояк Ю.К. 26.12.2024 УА #90201
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	МАКСИМУМ(ВТ_РасходныеОрдера.Ссылка) КАК Ссылка,
	|	ВТ_РасходныеОрдера.Распоряжение КАК Распоряжение,
	|	СУММА(1) КАК Количество
	|ПОМЕСТИТЬ ВТ_РасходныеОрдераКоличество
	|ИЗ
	|	ВТ_РасходныеОрдера КАК ВТ_РасходныеОрдера
	|	
	|СГРУППИРОВАТЬ ПО
	|	ВТ_РасходныеОрдера.Распоряжение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	//- ИнфоСофт Стояк Ю.К. 26.12.2024 УА #90201
	|ВЫБРАТЬ
	|	ДокументИС_Сбер_Отправление.Ссылка КАК Ссылка,
	|	ДокументИС_Сбер_Отправление.Номер КАК Номер,
	|	ДокументИС_Сбер_Отправление.Дата КАК Дата,
	|	ДокументИС_Сбер_Отправление.Заказ КАК Заказ,
	|	ДокументИС_Сбер_Отправление.orderCode КАК orderCode,
	|	ДокументИС_Сбер_Отправление.confirmedTimeLimit КАК confirmedTimeLimit,
	|	ДокументИС_Сбер_Отправление.packingTimeLimit КАК packingTimeLimit,
	|	ДокументИС_Сбер_Отправление.shippingTimeLimit КАК shippingTimeLimit,
	|	ДокументИС_Сбер_Отправление.deliveryId КАК deliveryId,
	|	ДокументИС_Сбер_Отправление.shipmentIsChangeable КАК shipmentIsChangeable,
	|	ДокументИС_Сбер_Отправление.customerFullName КАК customerFullName,
	|	ДокументИС_Сбер_Отправление.customerAddress КАК customerAddress,
	|	ДокументИС_Сбер_Отправление.deliveryDate КАК deliveryDate,
	|	ДокументИС_Сбер_Отправление.deliveryDateFrom КАК deliveryDateFrom,
	|	ДокументИС_Сбер_Отправление.deliveryDateTo КАК deliveryDateTo,
	|	ДокументИС_Сбер_Отправление.status КАК status,
	|	ДокументИС_Сбер_Отправление.deliveryMethodId КАК deliveryMethodId,
	|	ДокументИС_Сбер_Отправление.depositedAmount КАК depositedAmount,
	|	ВЫБОР
	|		КОГДА ВТ_КоличествоРеализаций.Реализация ЕСТЬ NULL
	|			ТОГДА """"
	|		КОГДА ВТ_КоличествоРеализаций.Количество = 1
	|			ТОГДА ВТ_КоличествоРеализаций.Реализация
	|		ИНАЧЕ ""Список реализаций""
	|	КОНЕЦ КАК Реализация,
	//+ ИнфоСофт Стояк Ю.К. 26.12.2024 УА #90201
	|	ВЫБОР
	|		КОГДА ВТ_РасходныеОрдераКоличество.Ссылка ЕСТЬ NULL
	|			ТОГДА """"
	|		КОГДА ВТ_РасходныеОрдераКоличество.Количество = 1
	|			ТОГДА ВТ_РасходныеОрдераКоличество.Ссылка
	|		ИНАЧЕ ""Список ордеров""
	|	КОНЕЦ КАК РасходныйОрдер,
	//- ИнфоСофт Стояк Ю.К. 26.12.2024 УА #90201
	//+ ИнфоСофт Тимофеева А.А. 04.09.2025 УА #79192 
	|	ВЫБОР        
	|		КОГДА ДокументИС_Сбер_Отправление.Заказ.Проведен
	|			ТОГДА 3
	|		КОГДА НЕ ДокументИС_Сбер_Отправление.Заказ.Проведен
	|			ТОГДА 1
	|       ИНАЧЕ 4
	|	КОНЕЦ КАК СтатусПроведенияЗаказа
	//- ИнфоСофт Тимофеева А.А. 04.09.2025 УА #79192
	|ИЗ
	|	Документ.ИС_Сбер_Отправление КАК ДокументИС_Сбер_Отправление
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КоличествоРеализаций КАК ВТ_КоличествоРеализаций
	|		ПО ДокументИС_Сбер_Отправление.Ссылка = ВТ_КоличествоРеализаций.Ссылка
	//+ ИнфоСофт Стояк Ю.К. 26.12.2024 УА #90201
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РасходныеОрдераКоличество КАК ВТ_РасходныеОрдераКоличество
	|		ПО ДокументИС_Сбер_Отправление.Заказ = ВТ_РасходныеОрдераКоличество.Распоряжение
	//- ИнфоСофт Стояк Ю.К. 26.12.2024 УА #90201
	|ГДЕ
	|	ДокументИС_Сбер_Отправление.Профиль = &Профиль
	|	И (&ВсеОтправления ИЛИ  ДокументИС_Сбер_Отправление.status В (&Статусы))";
	
	Возврат Текст;
		
КонецФункции //- ИнфоСофт Ивонин К.А. 28.11.23 УА #55166

//+ ИнфоСофт Стояк Ю.К. 01.04.2024 УА #62567
//+ ИнфоСофт Стояк Ю.К. 01.10.2024 УА #74295
Функция СоздатьДокументОтчетКомиссионера(Профиль, Период, ТаблицаТранзакций, Комментарий, ФукнциональныеОпции, СтруктураДопПараметров) Экспорт
//Функция СоздатьДокументОтчетКомиссионера(Профиль, Период, ТаблицаТранзакций, Комментарий, ФукнциональныеОпции) Экспорт
//- ИнфоСофт Стояк Ю.К. 01.10.2024 УА #74295		
	УстановитьПривилегированныйРежим(Истина);
	Событие = "Создание отчета комиссионеров";

	Если Не ЗначениеЗаполнено(ФукнциональныеОпции.Контрагент) Тогда

		ТекстСообщения = СтрШаблон(
			"Не заполнен контрагент в настройках СММ для аккаунта: %1. Документ отчет комиссионера не создан.",
			Профиль);
		ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, ТекстСообщения);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат Неопределено;

	КонецЕсли;

	ХозОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию");

	ИспользоватьДоговорыСКлиентами = ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыСКлиентами");
	Если ИспользоватьДоговорыСКлиентами Тогда

		Если ЗначениеЗаполнено(ФукнциональныеОпции.Договор) Тогда

			Если Не Общегоназначения.ЗначениеРеквизитаОбъекта(ФукнциональныеОпции.Договор, "ХозяйственнаяОперация") = ХозОперация Тогда

				ТекстСообщения = СтрШаблон(
					"В выбранный договор контрагента в настройках СММ для аккаунта: %1 имеет хозяйственную операцию отличающуюся от ""Передача на комиссию"". Документ отчет комиссионера не создан.",
					Профиль);
				ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, ТекстСообщения);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
				Возврат Неопределено;

			КонецЕсли;

		Иначе

			ТекстСообщения = СтрШаблон(
				"Не заполнен договор контрагента в настройках СММ для аккаунта: %1. Документ отчет комиссионера не создан.",
				Профиль);
			ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, ТекстСообщения);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Возврат Неопределено;

		КонецЕсли;
	КонецЕсли;

	ИспользоватьСоглашенияСКлиентами = ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами");
	Если ИспользоватьСоглашенияСКлиентами Тогда

		Если ЗначениеЗаполнено(ФукнциональныеОпции.Соглашение) Тогда

			Если Не Общегоназначения.ЗначениеРеквизитаОбъекта(ФукнциональныеОпции.Соглашение, "ХозяйственнаяОперация") = ХозОперация Тогда

				ТекстСообщения = СтрШаблон(
					"В выбранное соглашение с клиентом в настройках СММ для аккаунта: %1 имеет хозяйственную операцию отличающуюся от ""Передача на комиссию"". Документ отчет комиссионера не создан.",
					Профиль);
				ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, ТекстСообщения);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
				Возврат Неопределено;

			КонецЕсли;

		Иначе

			ТекстСообщения = СтрШаблон(
				"Не заполнено соглашение с клиентом в настройках СММ для аккаунта: %1. Документ отчет комиссионера не создан.",
				Профиль);
			ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, ТекстСообщения);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Возврат Неопределено;

		КонецЕсли;

	КонецЕсли;  
	
	ОбъектОтчетКомиссионера = Документы["ОтчетКомиссионера"].СоздатьДокумент();
	
	ОбъектОтчетКомиссионера.Дата 			= Период.ДатаОкончания;
	ОбъектОтчетКомиссионера.НачалоПериода 	= Период.ДатаНачала;
	ОбъектОтчетКомиссионера.КонецПериода 	= Период.ДатаОкончания;
	ОбъектОтчетКомиссионера.Комментарий		= Комментарий;
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("Организация", ФукнциональныеОпции.Организация);
	ДанныеЗаполнения.Вставить("Партнер", ФукнциональныеОпции.Партнер);
	ДанныеЗаполнения.Вставить("Контрагент", ФукнциональныеОпции.Контрагент);
	ДанныеЗаполнения.Вставить("Договор", ФукнциональныеОпции.Договор);
	ДанныеЗаполнения.Вставить("Соглашение", ФукнциональныеОпции.Соглашение);
	ДанныеЗаполнения.Вставить("ЗаполнятьПоСоглашению", Истина);
	ДанныеЗаполнения.Вставить("КонецПериода", Период.ДатаОкончания);
	ОбъектОтчетКомиссионера.Заполнить(ДанныеЗаполнения);

	ОбъектОтчетКомиссионера.Услуга = Справочники["Номенклатура"].НайтиПоНаименованию("Комиссионное вознаграждение", Истина);
	ПроцентНДС = ЦенообразованиеКлиентСервер.ПолучитьСтавкуНДСЧислом(ОбъектОтчетКомиссионера.СтавкаНДСВознаграждения);
	КомиссионнаяТорговляСервер.ЗаполнитьСтавкуНДСкомиссионногоВознаграждения(ОбъектОтчетКомиссионера, ПроцентНДС);

	ОбъектОтчетКомиссионера.СпособРасчетаВознаграждения = ПредопределенноеЗначение(
		"Перечисление.СпособыРасчетаКомиссионногоВознаграждения.ПроцентОтСуммыПродажи");
	ОбъектОтчетКомиссионера.ПроцентВознаграждения  		= 0;
	
	//+ ИнфоСофт Тимофеева А.А. 09.04.2025 УА #97340
	НастройкиУчета = УчетНДСУП.ПараметрыУчетаПоОрганизации(Профиль.Организация, ТекущаяДатаСеанса());
	ОбъектОтчетКомиссионера.НалогообложениеНДС = НастройкиУчета.ОсновноеНалогообложениеНДСПродажи;
	//- ИнфоСофт Тимофеева А.А. 09.04.2025 УА #97340
	
	//+ ИнфоСофт Стояк Ю.К. 01.10.2024 УА #74295		
	ЗаполнитьТЧОтчетаКомиссионера(ОбъектОтчетКомиссионера, ТаблицаТранзакций, СтруктураДопПараметров);
	//ЗаполнитьТЧОтчетаКомиссионера(ОбъектОтчетКомиссионера, ТаблицаТранзакций);
	//- ИнфоСофт Стояк Ю.К. 01.10.2024 УА #74295
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", Новый Структура("Организация, НалогообложениеНДС, Дата",
		ОбъектОтчетКомиссионера.Организация, ОбъектОтчетКомиссионера.НалогообложениеНДС, ОбъектОтчетКомиссионера.Дата));
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС",
		ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(ОбъектОтчетКомиссионера));
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", Новый Структура("ЦенаВключаетНДС",
		ОбъектОтчетКомиссионера.ЦенаВключаетНДС));	
	СтруктураДействий.Вставить("ПересчитатьСуммуПродажиНДС");
	ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(ОбъектОтчетКомиссионера.Товары, СтруктураДействий, Неопределено);

	ОбъектОтчетКомиссионера.СуммаВознаграждения = ОбъектОтчетКомиссионера.Товары.Итог("СуммаВознаграждения");
	ОбъектОтчетКомиссионера.СуммаНДСВознаграждения = Окр(ОбъектОтчетКомиссионера.СуммаВознаграждения * ПроцентНДС
		/ (100 + ПроцентНДС), 2, РежимОкругления.Окр15как20);

	Попытка

		ОбъектОтчетКомиссионера.Записать(РежимЗаписиДокумента.Проведение);

	Исключение

		ТекстСообщения = СтрШаблон("Не удалось провести документ отчет комиссионера: %1%2", Символы.ПС,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);

		Попытка
			ОбъектОтчетКомиссионера.Записать(РежимЗаписиДокумента.Запись);
		Исключение
			ТекстСообщения = СтрШаблон("Не удалось записать документ отчет комиссионера: %1%2", Символы.ПС,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецПопытки;

	КонецПопытки;        
	
	Возврат ОбъектОтчетКомиссионера.Ссылка;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 01.04.2024 УА #62567

//+ ИнфоСофт Стояк Ю.К. 01.04.2024 УА #62567
//+ ИнфоСофт Стояк Ю.К. 01.10.2024 УА #74295
Процедура ЗаполнитьТЧОтчетаКомиссионера(ОтчетКомиссионера, ТаблицаТранзакций, СтруктураДопПараметров, СуммаКомиссия = Неопределено)
//Процедура ЗаполнитьТЧОтчетаКомиссионера(ОтчетКомиссионера, ТаблицаТранзакций, СуммаКомиссия = Неопределено)
//- ИнфоСофт Стояк Ю.К. 01.10.2024 УА #74295
	
	ОтчетКомиссионера.Товары.Очистить();
	ОтчетКомиссионера.ВидыЗапасов.Очистить();  
	
	//+ ИнфоСофт Стояк Ю.К. 01.10.2024 УА #74295	
	АльтернативныйСпособ = Ложь; 
	
	Если СтруктураДопПараметров.Свойство("АльтернативныйСпособЗагрузки") Тогда
		АльтернативныйСпособ = СтруктураДопПараметров.АльтернативныйСпособЗагрузки; 
	КонецЕсли;                                  
	//- ИнфоСофт Стояк Ю.К. 01.10.2024 УА #74295
		
	Для Каждого Транзакция Из ТаблицаТранзакций Цикл	
		
		Если Транзакция.ЭтоНабор Тогда
			РеквизитыНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Транзакция.Номенклатура,
			"ТипНоменклатуры, ВидНоменклатуры");
			
			Если Транзакция.Количество > 0 Тогда
				ПараметрыКомплектующих = ПодборТоваровКлиентСервер.ПараметрыТовара();
				ПараметрыКомплектующих.Номенклатура   		= Транзакция.Номенклатура;
				ПараметрыКомплектующих.НоменклатураНабора   = Транзакция.Номенклатура;
				ПараметрыКомплектующих.ХарактеристикаНабора = Транзакция.ХарактеристикаНоменклатуры;				
				ПараметрыКомплектующих.КоличествоУпаковок	= Транзакция.Количество;
				ПараметрыКомплектующих.ТипНоменклатуры 		= РеквизитыНоменклатуры.ТипНоменклатуры;
				ПараметрыКомплектующих.ВидНоменклатуры 		= РеквизитыНоменклатуры.ВидНоменклатуры;
				ПараметрыКомплектующих.ЭтоТовар 			= Истина;
				ПараметрыКомплектующих.Вставить("ВариантКомплектацииНоменклатуры", Неопределено);
				
				Склады = Новый Массив;
				
				ДополнительныеПараметры = Новый Структура;
				ДополнительныеПараметры.Вставить("Дата", 		ОтчетКомиссионера.Дата);
				ДополнительныеПараметры.Вставить("Валюта", 		ОтчетКомиссионера.Валюта);
				ДополнительныеПараметры.Вставить("Склады", 		Склады);
				ДополнительныеПараметры.Вставить("Соглашение", 	ОтчетКомиссионера.Соглашение);
				ДополнительныеПараметры.Вставить("Цена", 		Транзакция.СтоимостьТовара  / Макс(-Транзакция.Количество, Транзакция.Количество));
				//+ ИнфоСофт Стояк Ю.К. 01.10.2024 УА #74295				
				Если АльтернативныйСпособ Тогда
					ДополнительныеПараметры.Вставить("ЦенаПродажи", Транзакция.СтоимостьТовара  / Макс(-Транзакция.Количество, Транзакция.Количество));
					ДополнительныеПараметры.Вставить("СуммаПродажиКРаспределению", ?(Транзакция.Количество > 0, Транзакция.СтоимостьТовара, -Транзакция.СтоимостьТовара));
					ДополнительныеПараметры.Вставить("Комиссия", 0);
				Иначе
					ДополнительныеПараметры.Вставить("ЦенаПродажи", Транзакция.ЦенаПродажи  / Макс(-Транзакция.Количество, Транзакция.Количество));	
					ДополнительныеПараметры.Вставить("СуммаПродажиКРаспределению", ?(Транзакция.Количество > 0, Транзакция.ЦенаПродажи, -Транзакция.ЦенаПродажи));
					ДополнительныеПараметры.Вставить("Комиссия", Транзакция.УслугиКРаспределению);
				КонецЕсли;
				//ДополнительныеПараметры.Вставить("ЦенаПродажи", Транзакция.ЦенаПродажи  / Макс(-Транзакция.Количество, Транзакция.Количество));    
				//ДополнительныеПараметры.Вставить("СуммаПродажиКРаспределению", ?(Транзакция.Количество > 0, Транзакция.ЦенаПродажи, -Транзакция.ЦенаПродажи));
				//ДополнительныеПараметры.Вставить("Комиссия", Транзакция.УслугиКРаспределению);
				//- ИнфоСофт Стояк Ю.К. 01.10.2024 УА #74295
				ДополнительныеПараметры.Вставить("СтоимостьДопУслуг", 0);
				
				ДополнительныеПараметры.Вставить("ВидЦены", ПредопределенноеЗначение("Справочник.ВидыЦен.ПустаяСсылка"));
				
				//+ ИнфоСофт Мурсалимов Д.Р. 20.08.24 УА #81483
				Комплектующие = ИС_МП_УправлениеЗаказами.Комплектующие(ПараметрыКомплектующих, ДополнительныеПараметры);
				//- ИнфоСофт Мурсалимов Д.Р. 20.08.24 УА #81483
				
				Для Каждого стрКомплекта Из Комплектующие Цикл
					
					НоваяСтрока = ОтчетКомиссионера.Товары.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, стрКомплекта);
					НоваяСтрока.КоличествоУпаковокУчет 	= НоваяСтрока.КоличествоУпаковок;
					НоваяСтрока.Сумма 					= НоваяСтрока.Цена * НоваяСтрока.КоличествоУпаковок
														+ стрКомплекта.Погрешность;
														
					//+ ИнфоСофт Мурсалимов Д.Р. 09.09.24 УА #83291
					НоваяСтрока.СуммаПродажи            = НоваяСтрока.ЦенаПродажи * НоваяСтрока.КоличествоУпаковок
														+ стрКомплекта.ПогрешностьСуммаПродажи;
					НоваяСтрока.СуммаВознаграждения 	= стрКомплекта.Комиссия * НоваяСтрока.КоличествоУпаковок
														+ стрКомплекта.ПогрешностьКомиссия; 
					//- ИнфоСофт Мурсалимов Д.Р. 09.09.24 УА #83291
					
				КонецЦикла;
			//+ ИнфоСофт Стояк Ю.К. 23.11.2024 УА #76394
			Иначе
				ПараметрыКомплектующих = ПодборТоваровКлиентСервер.ПараметрыТовара();
				ПараметрыКомплектующих.Номенклатура   		= Транзакция.Номенклатура;
				ПараметрыКомплектующих.НоменклатураНабора   = Транзакция.Номенклатура;
				ПараметрыКомплектующих.ХарактеристикаНабора = Транзакция.ХарактеристикаНоменклатуры;				
				ПараметрыКомплектующих.КоличествоУпаковок	= -Транзакция.Количество;
				ПараметрыКомплектующих.ТипНоменклатуры 		= РеквизитыНоменклатуры.ТипНоменклатуры;
				ПараметрыКомплектующих.ВидНоменклатуры 		= РеквизитыНоменклатуры.ВидНоменклатуры;
				ПараметрыКомплектующих.ЭтоТовар 			= Истина;
				ПараметрыКомплектующих.Вставить("ВариантКомплектацииНоменклатуры", Неопределено);
				
				Склады = Новый Массив;
				
				ДополнительныеПараметры = Новый Структура;
				ДополнительныеПараметры.Вставить("Дата", 		ОтчетКомиссионера.Дата);
				ДополнительныеПараметры.Вставить("Валюта", 		ОтчетКомиссионера.Валюта);
				ДополнительныеПараметры.Вставить("Склады", 		Склады);
				ДополнительныеПараметры.Вставить("Соглашение", 	ОтчетКомиссионера.Соглашение);
				ДополнительныеПараметры.Вставить("Цена", 		Транзакция.СтоимостьТовара  / Макс(-Транзакция.Количество, Транзакция.Количество));
				
				Если АльтернативныйСпособ Тогда
					ДополнительныеПараметры.Вставить("ЦенаПродажи", Транзакция.СтоимостьТовара  / Макс(-Транзакция.Количество, Транзакция.Количество));
					ДополнительныеПараметры.Вставить("СуммаПродажиКРаспределению", ?(Транзакция.Количество > 0, Транзакция.СтоимостьТовара, -Транзакция.СтоимостьТовара));
					ДополнительныеПараметры.Вставить("Комиссия", 0);
				Иначе
					ДополнительныеПараметры.Вставить("ЦенаПродажи", Транзакция.ЦенаПродажи  / Макс(-Транзакция.Количество, Транзакция.Количество));	
					ДополнительныеПараметры.Вставить("СуммаПродажиКРаспределению", ?(Транзакция.Количество > 0, Транзакция.ЦенаПродажи, -Транзакция.ЦенаПродажи));
					ДополнительныеПараметры.Вставить("Комиссия", Транзакция.УслугиКРаспределению);
				КонецЕсли;
				
				ДополнительныеПараметры.Вставить("СтоимостьДопУслуг", 0);
				
				ДополнительныеПараметры.Вставить("ВидЦены", ПредопределенноеЗначение("Справочник.ВидыЦен.ПустаяСсылка"));
								
				Комплектующие = ИС_МП_УправлениеЗаказами.Комплектующие(ПараметрыКомплектующих, ДополнительныеПараметры);				
				
				Для Каждого стрКомплекта Из Комплектующие Цикл
					
					НоваяСтрока = ОтчетКомиссионера.Товары.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, стрКомплекта);
					НоваяСтрока.КоличествоУпаковок 		= -стрКомплекта.КоличествоУпаковок;
					НоваяСтрока.КоличествоУпаковокУчет 	= -стрКомплекта.КоличествоУпаковок;
					НоваяСтрока.Сумма 					= НоваяСтрока.Цена * НоваяСтрока.КоличествоУпаковок
					+ стрКомплекта.Погрешность;
										
					НоваяСтрока.СуммаПродажи            = НоваяСтрока.ЦенаПродажи * -НоваяСтрока.КоличествоУпаковок
					+ стрКомплекта.ПогрешностьСуммаПродажи;
					НоваяСтрока.СуммаВознаграждения 	= стрКомплекта.Комиссия * НоваяСтрока.КоличествоУпаковок
					+ стрКомплекта.ПогрешностьКомиссия; 					
										
				КонецЦикла;
			//- ИнфоСофт Стояк Ю.К. 23.11.2024 УА #76394
			КонецЕсли;
			
		Иначе
			
			//+ ИнфоСофт Стояк Ю.К. 23.11.2024 УА #76394			
			//Если Транзакция.Количество > 0 Тогда
			Если Транзакция.Количество <> 0 Тогда
			//- ИнфоСофт Стояк Ю.К. 23.11.2024 УА #76394
				НоваяСтрока = ОтчетКомиссионера.Товары.Добавить();
				НоваяСтрока.Номенклатура 			= Транзакция.Номенклатура;
				НоваяСтрока.Характеристика 			= Транзакция.ХарактеристикаНоменклатуры;
				//+ ИнфоСофт Мурсалимов Д.Р. 05.09.24 УА #82005
				//НоваяСтрока.Количество 				= Транзакция.КоличествоВУпаковке * Транзакция.Количество;
				НоваяСтрока.Количество 				= Транзакция.КоэффициентУпаковки * Транзакция.Количество;
				//- ИнфоСофт Мурсалимов Д.Р. 05.09.24 УА #82005
				НоваяСтрока.Упаковка 				= Транзакция.Упаковка;
				НоваяСтрока.КоличествоУпаковокУчет 	= Транзакция.Количество;
				НоваяСтрока.КоличествоУпаковок 		= Транзакция.Количество;
				НоваяСтрока.Цена 					= Транзакция.СтоимостьТовара  / Макс(-НоваяСтрока.Количество, НоваяСтрока.Количество);
				//+ ИнфоСофт Стояк Ю.К. 01.10.2024 УА #74295				                                                          
				Если АльтернативныйСпособ Тогда
					НоваяСтрока.ЦенаПродажи             = Транзакция.СтоимостьТовара  / Макс(-НоваяСтрока.Количество, НоваяСтрока.Количество);
				Иначе
					НоваяСтрока.ЦенаПродажи             = Транзакция.ЦенаПродажи  / Макс(-НоваяСтрока.Количество, НоваяСтрока.Количество);
				КонецЕсли;
				//НоваяСтрока.ЦенаПродажи             = Транзакция.ЦенаПродажи  / Макс(-НоваяСтрока.Количество, НоваяСтрока.Количество);
				//- ИнфоСофт Стояк Ю.К. 01.10.2024 УА #74295
				НоваяСтрока.Сумма 					= НоваяСтрока.Цена * НоваяСтрока.Количество;
				НоваяСтрока.СуммаПродажи            = НоваяСтрока.ЦенаПродажи * НоваяСтрока.Количество;				
				НоваяСтрока.СуммаВознаграждения 	= Транзакция.УслугиКРаспределению; 
				
			КонецЕсли;
									
		КонецЕсли;
		
	КонецЦикла; 
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 01.04.2024 УА #62567

//+ ИнфоСофт Стояк Ю.К. 01.04.2024 УА #62567
Функция Комплектующие(Параметры, ДополнительныеПараметры)
		
	УстановитьПривилегированныйРежим(Истина);

	Если Не ЗначениеЗаполнено(Параметры.ВариантКомплектацииНоменклатуры) Тогда
		ВариантКомплектацииНоменклатуры = ВариантКомплектацииНоменклатурыПоУмолчанию(
			Параметры.НоменклатураНабора, Параметры.ХарактеристикаНабора);
	Иначе
		ВариантКомплектацииНоменклатуры = Параметры.ВариантКомплектацииНоменклатуры;
	КонецЕсли;

	Если Не Параметры.Свойство("КоличествоУпаковок") Тогда
		Параметры.Вставить("КоличествоУпаковок", 1);
	КонецЕсли;

	ПодобранныеТовары = Новый Массив;

	Если Не ЗначениеЗаполнено(ВариантКомплектацииНоменклатуры) Тогда
		ТекстОшибки = СтрШаблон("Для номенклатуры %1 %2 не определен состав набора", Параметры.НоменклатураНабора,
			Параметры.ХарактеристикаНабора);
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		Возврат ПодобранныеТовары;
	КонецЕсли;
	
	Колонки = Новый Массив;
	Колонки.Добавить("НомерСтроки");
	Колонки.Добавить("НоменклатураКомплекта");
	Колонки.Добавить("ХарактеристикаКомплекта");
	Колонки.Добавить("Номенклатура");
	Колонки.Добавить("Характеристика");
	Колонки.Добавить("Цена");
	Колонки.Добавить("ВидЦены");
	Колонки.Добавить("Упаковка");
	Колонки.Добавить("Количество");
	Колонки.Добавить("КоличествоУпаковок");
	Колонки.Добавить("ПроцентРучнойСкидки");
	Колонки.Добавить("СуммаРучнойСкидки");
	Колонки.Добавить("Доступно");
	Колонки.Добавить("ВНаличии");

	Комплектующие = НаборыСервер.СоздатьТаблицуСоставаНабора(Колонки);
	Комплектующие.Колонки.Добавить("ТипНоменклатуры", Новый ОписаниеТипов("ПеречислениеСсылка.ТипыНоменклатуры"));
	Комплектующие.Колонки.Добавить("ВидНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.ВидыНоменклатуры"));
	Комплектующие.Колонки.Добавить("ЕдиницаИзмерения", Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"));
	Комплектующие.Колонки.Добавить("Комиссия", Новый ОписаниеТипов("Число"));

	Запрос = Новый Запрос("ВЫБРАТЬ
						  |	ВариантыКомплектацииНоменклатурыТовары.НомерСтроки КАК НомерСтроки,
						  |	ВариантыКомплектацииНоменклатурыТовары.Номенклатура КАК Номенклатура,
						  |	ВариантыКомплектацииНоменклатурыТовары.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
						  |	ВариантыКомплектацииНоменклатурыТовары.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
						  |	ВариантыКомплектацииНоменклатурыТовары.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
						  |	ВариантыКомплектацииНоменклатурыТовары.Характеристика КАК Характеристика,
						  |	ВариантыКомплектацииНоменклатурыТовары.Упаковка КАК Упаковка,
						  |	ВариантыКомплектацииНоменклатурыТовары.КоличествоУпаковок КАК КоличествоУпаковок,
						  |	ВариантыКомплектацииНоменклатурыТовары.Количество КАК Количество,
						  |	ВариантыКомплектацииНоменклатурыТовары.ДоляСтоимости КАК ДоляСтоимости,
						  |	СУММА(ЕСТЬNULL(ДоступностьТоваров.ВНаличии, 0) / ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки, 1)) КАК ВНаличии,
						  |	СУММА(ЕСТЬNULL(ДоступностьТоваров.Свободно, 0) / ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки, 1)) КАК Доступно
						  |ИЗ
						  |	Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
						  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеЗапасов КАК ДоступностьТоваров
						  |		ПО ДоступностьТоваров.Номенклатура = ВариантыКомплектацииНоменклатурыТовары.Номенклатура
						  |			И ДоступностьТоваров.Характеристика = ВариантыКомплектацииНоменклатурыТовары.Характеристика
						  |			И ДоступностьТоваров.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе)
						  |			И ДоступностьТоваров.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
						  |			И &ФильтрСклады
						  |ГДЕ
						  |	ВариантыКомплектацииНоменклатурыТовары.Ссылка = &Ссылка
						  |
						  |СГРУППИРОВАТЬ ПО
						  |	ВариантыКомплектацииНоменклатурыТовары.Характеристика,
						  |	ВариантыКомплектацииНоменклатурыТовары.Упаковка,
						  |	ВариантыКомплектацииНоменклатурыТовары.Номенклатура,
						  |	ВариантыКомплектацииНоменклатурыТовары.НомерСтроки,
						  |	ВариантыКомплектацииНоменклатурыТовары.Номенклатура.ТипНоменклатуры,
						  |	ВариантыКомплектацииНоменклатурыТовары.Номенклатура.ЕдиницаИзмерения,
						  |	ВариантыКомплектацииНоменклатурыТовары.Номенклатура.ВидНоменклатуры,
						  |	ВариантыКомплектацииНоменклатурыТовары.КоличествоУпаковок,
						  |	ВариантыКомплектацииНоменклатурыТовары.Количество,
						  |	ВариантыКомплектацииНоменклатурыТовары.ДоляСтоимости");

	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаКоэффициентУпаковки",
		Справочники["УпаковкиЕдиницыИзмерения"].ТекстЗапросаКоэффициентаУпаковки(
		"ВЫРАЗИТЬ(ВариантыКомплектацииНоменклатурыТовары.Упаковка КАК Справочник.УпаковкиЕдиницыИзмерения)",
		"ВЫРАЗИТЬ(ВариантыКомплектацииНоменклатурыТовары.Номенклатура КАК Справочник.Номенклатура)"));

	Запрос.УстановитьПараметр("Ссылка", ВариантКомплектацииНоменклатуры);

	Если ДополнительныеПараметры.Свойство("Склады") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ФильтрСклады", "ДоступностьТоваров.Склад В (&Склады)");
		Запрос.УстановитьПараметр("Склады", ДополнительныеПараметры.Склады);
	Иначе
		Запрос.УстановитьПараметр("ФильтрСклады", Истина);
	КонецЕсли;

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл

		НоваяСтрока = Комплектующие.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.КоличествоУпаковок   = НоваяСтрока.КоличествоУпаковок;
		НоваяСтрока.Количество           = НоваяСтрока.Количество;
		НоваяСтрока.НоменклатураНабора   = Параметры.НоменклатураНабора;
		НоваяСтрока.ХарактеристикаНабора = Параметры.ХарактеристикаНабора;

	КонецЦикла;
	Если ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами") И ДополнительныеПараметры.Свойство("Соглашение")
		И ЗначениеЗаполнено(ДополнительныеПараметры.Соглашение) Тогда

		ПараметрыРасчета = Новый Структура;
		ПараметрыРасчета.Вставить("Дата", ДополнительныеПараметры.Дата);
		ПараметрыРасчета.Вставить("Валюта", ДополнительныеПараметры.Валюта);
		ПараметрыРасчета.Вставить("Соглашение", ДополнительныеПараметры.Соглашение);
		ПараметрыРасчета.Вставить("ПоляЗаполнения", "Цена");

	Иначе

		ПараметрыРасчета = Новый Структура;
		ПараметрыРасчета.Вставить("Дата", ДополнительныеПараметры.Дата);
		ПараметрыРасчета.Вставить("Валюта", ДополнительныеПараметры.Валюта);
		ПараметрыРасчета.Вставить("ВидЦены", ДополнительныеПараметры.ВидЦены);
		ПараметрыРасчета.Вставить("ПоляЗаполнения", "Цена");

	КонецЕсли;

	КоэффициентыПропорциональностиРасчетаЦенНаборов = КоэффициентыРаспределенияПоДолям(Комплектующие.Скопировать(),
		ПараметрыРасчета);

	ОбщаяСтоимость = 0;
	Для Каждого ТекущаяСтрока Из КоэффициентыПропорциональностиРасчетаЦенНаборов Цикл
		ОбщаяСтоимость = ОбщаяСтоимость + ТекущаяСтрока.Цена;
	КонецЦикла;

	СуммаКРаспределению 		= ДополнительныеПараметры.Цена * Параметры.КоличествоУпаковок;
	СуммаПродажиКРаспределению 	= ДополнительныеПараметры.СуммаПродажиКРаспределению;
	СуммаКомиссииКРаспределению = ДополнительныеПараметры.Комиссия;

	СлужебнаяТЧ = Новый ТаблицаЗначений;
	СлужебнаяТЧ.Колонки.Добавить("СтрокаТЧ");
	СлужебнаяТЧ.Колонки.Добавить("НомерСтроки");

	Комплектующие.Сортировать("КоличествоУпаковок Убыв");
	Для Каждого ТекущаяСтрока Из Комплектующие Цикл

		Стоимость = КоэффициентыПропорциональностиРасчетаЦенНаборов.Найти(ТекущаяСтрока.НомерСтроки, "НомерСтроки").Цена;

		ПараметрыТовара = ПодборТоваровКлиентСервер.ПараметрыТовара();
		ЗаполнитьЗначенияСвойств(ПараметрыТовара, Параметры);

		ПараметрыТовара.Номенклатура       = ТекущаяСтрока.Номенклатура;
		ПараметрыТовара.Характеристика     = ТекущаяСтрока.Характеристика;
		ПараметрыТовара.Упаковка           = ТекущаяСтрока.Упаковка;
		ПараметрыТовара.ТипНоменклатуры    = ТекущаяСтрока.ТипНоменклатуры;
		ПараметрыТовара.ВидНоменклатуры    = ТекущаяСтрока.ВидНоменклатуры;
		ПараметрыТовара.ЕдиницаИзмерения   = ТекущаяСтрока.ЕдиницаИзмерения;
		ПараметрыТовара.КоличествоУпаковок = ТекущаяСтрока.КоличествоУпаковок * Параметры.КоличествоУпаковок;
		ПараметрыТовара.Количество         = ТекущаяСтрока.Количество * Параметры.КоличествоУпаковок;
		ПараметрыТовара.Вставить("ПогрешностьКомиссия", 0);
		ПараметрыТовара.Вставить("ПогрешностьСуммаПродажи", 0);

		Если ПараметрыТовара.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга")
			Или ПараметрыТовара.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Работа") Тогда
			ПараметрыТовара.Склад = ПредопределенноеЗначение("Справочник.Склады.ПустаяСсылка");
		КонецЕсли;

		Если ДополнительныеПараметры.Свойство("ВидЦены") Тогда
			ПараметрыТовара.ВидЦены = ДополнительныеПараметры.ВидЦены;
		Иначе
			ПараметрыТовара.ВидЦены =ПредопределенноеЗначение("Справочник.ВидыЦен.ПустаяСсылка");
		КонецЕсли;

		Если ПараметрыТовара.КоличествоУпаковок <> 0 И ОбщаяСтоимость <> 0 Тогда
			ПараметрыТовара.Цена = Окр(((Стоимость / ОбщаяСтоимость) * СуммаКРаспределению)
				/ ПараметрыТовара.КоличествоУпаковок, 2);
			ПараметрыТовара.Вставить("ЦенаПродажи", Окр(((Стоимость / ОбщаяСтоимость) * СуммаПродажиКРаспределению)
				/ ПараметрыТовара.КоличествоУпаковок, 2));	
			ПараметрыТовара.Вставить("Комиссия", Окр(((Стоимость / ОбщаяСтоимость) * СуммаКомиссииКРаспределению
				/ ПараметрыТовара.КоличествоУпаковок), 2));
		Иначе
			ПараметрыТовара.Цена = 0;
			ПараметрыТовара.Вставить("ЦенаПродажи", 0);
			ПараметрыТовара.Вставить("Комиссия", 0);
		КонецЕсли;

		ОбщаяСтоимость = ОбщаяСтоимость - Стоимость;
		СуммаКРаспределению 		= СуммаКРаспределению - ПараметрыТовара.Цена * ПараметрыТовара.КоличествоУпаковок;
		СуммаПродажиКРаспределению 	= СуммаПродажиКРаспределению - ПараметрыТовара.ЦенаПродажи * ПараметрыТовара.КоличествоУпаковок;
		СуммаКомиссииКРаспределению = СуммаКомиссииКРаспределению - ПараметрыТовара.Комиссия
			* ПараметрыТовара.КоличествоУпаковок;

		ПараметрыТовара.Доступно = ТекущаяСтрока.Доступно;
		ПараметрыТовара.ВНаличии = ТекущаяСтрока.ВНаличии;

		ПараметрыТовара.ХарактеристикиИспользуются = ?(ЗначениеЗаполнено(ПараметрыТовара.Характеристика), Истина, Ложь);

		СлужебнаяСтрока = СлужебнаяТЧ.Добавить();
		СлужебнаяСтрока.СтрокаТЧ = ПараметрыТовара;
		СлужебнаяСтрока.НомерСтроки = ТекущаяСтрока.НомерСтроки;

	КонецЦикла;

	Если (СуммаКРаспределению <> 0 Или СуммаПродажиКРаспределению <> 0 Или СуммаКомиссииКРаспределению <> 0) И СлужебнаяТЧ.Количество() > 0 Тогда

		ПоследняяСтрока = СлужебнаяТЧ[СлужебнаяТЧ.Количество() - 1];
		ИсходнаяСтрока = ПоследняяСтрока.СтрокаТЧ;
		ИсходнаяСтрока.Погрешность 				= СуммаКРаспределению;
		ИсходнаяСтрока.ПогрешностьСуммаПродажи 	= СуммаПродажиКРаспределению;
		ИсходнаяСтрока.ПогрешностьКомиссия 		= СуммаКомиссииКРаспределению;

	КонецЕсли;

	СлужебнаяТЧ.Сортировать("НомерСтроки Возр");
	Для Каждого СтрокаТЧ Из СлужебнаяТЧ Цикл
		ПодобранныеТовары.Добавить(СтрокаТЧ.СтрокаТЧ);
	КонецЦикла;

	Возврат ПодобранныеТовары;

КонецФункции //- ИнфоСофт Стояк Ю.К. 01.04.2024 УА #62567

//+ ИнфоСофт Стояк Ю.К. 01.04.2024 УА #62567
Функция ВариантКомплектацииНоменклатурыПоУмолчанию(Знач Номенклатура, Знач Характеристика)

	ВариантКомплектацииНоменклатуры = Неопределено;

	Если Характеристика = Неопределено Тогда
		Характеристика = ПредопределенноеЗначение("Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка");
	КонецЕсли;

	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
						  |	ВариантыКомплектацииНоменклатуры.Ссылка КАК ВариантКомплектацииНоменклатуры
						  |ИЗ
						  |	Справочник.ВариантыКомплектацииНоменклатуры КАК ВариантыКомплектацииНоменклатуры
						  |ГДЕ
						  |	ВариантыКомплектацииНоменклатуры.Владелец = &Владелец
						  |	И ВариантыКомплектацииНоменклатуры.Характеристика = &Характеристика
						  |
						  |УПОРЯДОЧИТЬ ПО
						  |	ВариантыКомплектацииНоменклатуры.Основной УБЫВ,
						  |	ВариантыКомплектацииНоменклатуры.ПометкаУдаления");

	Запрос.УстановитьПараметр("Владелец", Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ВариантКомплектацииНоменклатуры = Выборка.ВариантКомплектацииНоменклатуры;
	КонецЕсли;

	Возврат ВариантКомплектацииНоменклатуры;

КонецФункции //- ИнфоСофт Стояк Ю.К. 01.04.2024 УА #62567

//+ ИнфоСофт Стояк Ю.К. 01.04.2024 УА #62567
Функция КоэффициентыРаспределенияПоДолям(ТабличнаяЧасть, Параметры)

	Запрос = Новый Запрос("ВЫБРАТЬ
						  |	Таблица.НомерСтроки                                       КАК НомерСтроки,
						  |	Таблица.НоменклатураНабора                                КАК НоменклатураНабора,
						  |	Таблица.ХарактеристикаНабора                              КАК ХарактеристикаНабора,
						  |	Таблица.Номенклатура                                      КАК Номенклатура,
						  |	Таблица.Характеристика                                    КАК Характеристика,
						  |	Таблица.Упаковка                                          КАК Упаковка,
						  |	Таблица.Количество                                        КАК Количество,
						  |	Таблица.КоличествоУпаковок                                КАК КоличествоУпаковок
						  |ПОМЕСТИТЬ Таблица
						  |ИЗ
						  |	&ТабличнаяЧасть КАК Таблица
						  |;
						  |
						  |//////////////////////////
						  |ВЫБРАТЬ
						  |	Таблица.НомерСтроки                                       КАК НомерСтроки,
						  |	Таблица.НоменклатураНабора                                КАК НоменклатураНабора,
						  |	Таблица.ХарактеристикаНабора                              КАК ХарактеристикаНабора,
						  |	Таблица.Номенклатура                                      КАК Номенклатура,
						  |	Таблица.Характеристика                                    КАК Характеристика,
						  |	Таблица.Упаковка                                          КАК Упаковка,
						  |	Таблица.Количество                                        КАК Количество,
						  |	Таблица.КоличествоУпаковок                                КАК КоличествоУпаковок,
						  |	ВариантыКомплектацииНоменклатуры.Ссылка                   КАК ВариантыКомплектацииНоменклатуры,
						  |	ВариантыКомплектацииНоменклатуры.ВариантРасчетаЦеныНабора КАК ВариантРасчетаЦеныНабора
						  |ПОМЕСТИТЬ ТаблицаСВариантамиКомплектации
						  |ИЗ
						  |	Таблица КАК Таблица
						  |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры КАК ВариантыКомплектацииНоменклатуры
						  |		ПО Таблица.НоменклатураНабора = ВариантыКомплектацииНоменклатуры.Владелец
						  |			И Таблица.ХарактеристикаНабора = ВариантыКомплектацииНоменклатуры.Характеристика
						  |			И ВариантыКомплектацииНоменклатуры.Основной
						  |;
						  |
						  |/////
						  |ВЫБРАТЬ
						  |	Товары.Ссылка            КАК ВариантыКомплектацииНоменклатуры,
						  |	Товары.Номенклатура      КАК Номенклатура,
						  |	Товары.Характеристика    КАК Характеристика,
						  |	СУММА(ВЫБОР
						  |			КОГДА Товары.Количество <> 0
						  |				ТОГДА Выбор Когда Товары.ДоляСтоимости = 0 Тогда 1 Иначе  Товары.ДоляСтоимости Конец/ Товары.Количество
						  |			ИНАЧЕ 0
						  |		КОНЕЦ) КАК ДоляСтоимости
						  |ПОМЕСТИТЬ ДолиСтоимости
						  |ИЗ
						  |	Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК Товары
						  |
						  |СГРУППИРОВАТЬ ПО
						  |	Товары.Номенклатура,
						  |	Товары.Характеристика,
						  |	Товары.Ссылка
						  |;
						  |
						  |/////
						  |ВЫБРАТЬ
						  |	Таблица.НомерСтроки                                           КАК НомерСтроки,
						  |	Таблица.НоменклатураНабора                                    КАК НоменклатураНабора,
						  |	Таблица.ХарактеристикаНабора                                  КАК ХарактеристикаНабора,
						  |	Таблица.Номенклатура                                          КАК Номенклатура,
						  |	Таблица.Характеристика                                        КАК Характеристика,
						  |	Таблица.Упаковка                                              КАК Упаковка,
						  |	Таблица.Количество                                            КАК Количество,
						  |	Таблица.КоличествоУпаковок                                    КАК КоличествоУпаковок,
						  |	ВЫРАЗИТЬ(Таблица.Количество * ЕСТЬNULL(ДолиСтоимости.ДоляСтоимости, 0) КАК Число(15,2)) КАК Цена,
						  |	Таблица.ВариантыКомплектацииНоменклатуры                      КАК ВариантыКомплектацииНоменклатуры,
						  |	Таблица.ВариантРасчетаЦеныНабора                              КАК ВариантРасчетаЦеныНабора
						  |ИЗ
						  |	ТаблицаСВариантамиКомплектации КАК Таблица
						  |		ЛЕВОЕ СОЕДИНЕНИЕ ДолиСтоимости КАК ДолиСтоимости
						  |		ПО ДолиСтоимости.ВариантыКомплектацииНоменклатуры = Таблица.ВариантыКомплектацииНоменклатуры
						  |			И Таблица.Номенклатура = ДолиСтоимости.Номенклатура
						  |			И Таблица.Характеристика = ДолиСтоимости.Характеристика
						  |");
	
	// Выгрузить из таблицы источника
	Если ТипЗнч(ТабличнаяЧасть) = Тип("ТаблицаЗначений") Тогда
		Запрос.Параметры.Вставить("ТабличнаяЧасть", ТабличнаяЧасть.Скопировать());
	Иначе
		Запрос.Параметры.Вставить("ТабличнаяЧасть", ТабличнаяЧасть.Выгрузить());
	КонецЕсли;

	ПараметрыРасчета = Новый Структура;
	Для Каждого Параметр Из Параметры Цикл
		ПараметрыРасчета.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	ПараметрыРасчета.Вставить("РассчитыватьНаборы", Ложь);

	ТЧ = Запрос.Выполнить().Выгрузить();

	Для Каждого СтрокаТЧ Из ТЧ Цикл
		СтрокаТЧ.Цена = Окр(СтрокаТЧ.Цена * СтрокаТЧ.КоличествоУпаковок, 2);
	КонецЦикла;

	Возврат ТЧ;

КонецФункции //- ИнфоСофт Стояк Ю.К. 01.04.2024 УА #62567

//+ ИнфоСофт Стояк Ю.К. 01.04.2024 УА #62567
Функция ПолучитьДокументКорректировкиЗадолженности(ДокОтчет, Сумма) Экспорт 
	
	Корректировка = Документы.КорректировкаЗадолженности.СоздатьДокумент();	
	
	Корректировка.Дата = ДокОтчет.Дата;
	
	Корректировка.Организация = ДокОтчет.Организация;
	
	Корректировка.Контрагент = ДокОтчет.Контрагент;
	
	Корректировка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.НачислениеДебиторскойЗадолженности; 
	
	Корректировка.ЭтоНачисление = Истина;
	
	Корректировка.КорреспонденцияСДоходами = Ложь;
	
	Корректировка.РасчетыМеждуОрганизациями = Ложь;
	
	СтрокаТЧ = Корректировка.Задолженность.Добавить();
	
	СтрокаТЧ.ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом;
	
	СтрокаТЧ.Партнер = Докотчет.Партнер;
	
	СтрокаТЧ.ВалютаВзаиморасчетов = Докотчет.Валюта; 
	
	СтрокаТЧ.Сумма = Сумма;
	
	Если ЗначениеЗаполнено(ДокОтчет.Соглашение) И ЗначениеЗаполнено(ДокОтчет.Соглашение.ПорядокРасчетов) Тогда
		ПорядокРасчетов = ДокОтчет.Соглашение.ПорядокРасчетов;
	Иначе
		ПорядокРасчетов = ДокОтчет.Договор.ПорядокРасчетов;	
	КонецЕсли;
	
	Если ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоНакладным Тогда
		ОбъектРасчетов = Справочники.ОбъектыРасчетов.НайтиПоРеквизиту("Объект", Докотчет.Ссылка);	
	Иначе
		ОбъектРасчетов = Справочники.ОбъектыРасчетов.НайтиПоРеквизиту("Объект", ДокОтчет.Договор);	
	КонецЕсли;	
	
	СтрокаТЧ.ОбъектРасчетов = ОбъектРасчетов;

	//СтрокаТЧ.ДатаПлатежа = Корректировка.Дата;
	
	Попытка
		Корректировка.Записать(РежимЗаписиДокумента.Проведение);	
	Исключение	
		Корректировка.Записать(РежимЗаписиДокумента.Запись);
	КонецПопытки;  
	
	Возврат Корректировка.Ссылка;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 01.04.2024 УА #62567

#КонецОбласти
